Catalogs/ФормулыКаталога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ФормулыКаталога</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазвернутаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФормулыКаталога/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФормулыКаталога.Ссылка
	|ИЗ
	|	Справочник.ФормулыКаталога КАК ФормулыКаталога
	|ГДЕ
	|	ФормулыКаталога.Наименование = &Наименование
	|	И ФормулыКаталога.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование формулы уже существует", ,"Объект.Наименование");
		Отказ = Истина;
		
	КонецЕсли;
	
	//Проверка наименования в структуре
	Попытка
		Структура = Новый Структура;
		Структура.Вставить(Наименование, Наименование);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильное наименование формулы", ,"Объект.Наименование");
		Отказ = Истина;
	КонецПопытки;
	
	РазвернутаяФормула = РазвернутьФормулу(Формула, 0);
	Активность = Активность И ЗначениеЗаполнено(РазвернутаяФормула);
	
КонецПроцедуры

Функция РазвернутьФормулу(нФормула, НомерЦикла) Экспорт
	
	НашаФормула = нФормула;
	
	Если НомерЦикла = 3 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Слишком большая вложенность формулы", ,"Объект.Формула");
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЧислоФормул = СтрЧислоВхождений(НашаФормула, "%%") / 2;
	
	Если ЧислоФормул > 0 Тогда
		
		МассивНаименований = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НашаФормула, "%%");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", МассивНаименований);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФормулыКаталога.Наименование,
		|	ФормулыКаталога.Формула
		|ИЗ
		|	Справочник.ФормулыКаталога КАК ФормулыКаталога
		|ГДЕ
		|	ФормулыКаталога.Активность
		|	И НЕ ФормулыКаталога.ПометкаУдаления
		|	И ФормулыКаталога.Наименование В(&Наименование)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() <> ЧислоФормул Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некоторые формулы не найдены", ,"Объект.Формула");
			Возврат Неопределено;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			НашаФормула = СтрЗаменить(НашаФормула, "%%" + Выборка.Наименование + "%%", Выборка.Формула); 
			
		КонецЦикла;
		
		НашаФормула = РазвернутьФормулу(НашаФормула, НомерЦикла + 1);
		
	КонецЕсли;
	
	Возврат НашаФормула;
	
КонецФункции
